Repository: jimregan/citizens-information-raw
Catalog: en-ro/www.citizensinformation.ie/ro/moving_country/moving_abroad/leaving_ireland/leaving_ireland_and_your_social_security_entitlements.html.txt.tmx
Source language: en
Languages: ro

source: Leaving Ireland and your social security entitlements
ro: Plecarea din Irlanda şi drepturile dumneavoastră la protecţie socială

source: • Countries covered by EU Regulations
ro: • Ţările acoperite de reglementările UE

source: Some people leave Ireland to work or study for a short period (that is, a few months), other people go abroad for longer
ro: În fiecare an mii de cetăţeni părăsesc Irlanda pentru a munci, călători, studia sau a se retrage în străinătate

source: If you leave Ireland to live and/or work in another country, you may be entitled to receive social security benefits in the country you are moving to
ro: Unele persoane părăsesc Irlanda pentru a munci sau studia pentru o perioadă scurtă (adică doar câteva luni), alte persoane merg în străinătate pentru perioade mai lungi

source: You can find information about it in our document on social security arrangements that Ireland has with other countries
ro: Mulţi alţii care au locuit, studiat sau lucrat în Irlanda pleacă, de asemenea, spre ţările lor de origine

source: Some Irish social welfare payments can be paid abroad – you can read more in our document on going abroad and social welfare payments
ro: Este important, prin urmare, să fiţi conştient(ă) de faptul că, dacă părăsiţi Irlanda pentru a trăi si/sau munci într-o altă ţară, puteţi avea dreptul să primiţi ajutoare de protecţie socială în ţara în care vă mutaţi

source: Countries covered by EU Regulations
ro: Ţările acoperite de reglementările UE

source: If you move to live or work in a country covered by EU Regulations, this means that for social security benefits or services, you are entitled to be treated in the same way as the nationals in the EU member state or EEA country that you move to
ro: Dacă vă mutaţi ca să locuiţi sau să lucraţi într-o ţară acoperită de Reglementările UE, aceasta înseamnă că, în ceea ce priveşte ajutoarele/serviciile de protecţie socială, aveţi dreptul să fiţi tratat(ă) în acelaşi mod ca şi cetăţenii din Statul Membru UE /ţara SEE în care vă mutaţi

source: On a practical level, this means that you and your family are entitled to apply for any benefits or assistance available in the country in which you reside
ro: Practic, aceasta înseamnă că dumneavoastră şi familia dumneavoastră aveţi dreptul să solicitaţi orice ajustoare sau asistenţă disponibile în ţara în care domiciliaţi

source: If you are applying for insurance-based payments, any contributions made in other EU member states or EEA countries should be taken into account
ro: Dacă solicitaţi plăţi pe bază de asigurare, orice contribuţii plătite în alte State Membre UE /ţări SEE trebuie să fie luate în considerare

source: Social insurance contribution record
ro: Dosarul de contribuţie la asigurările sociale

source: If you need to claim benefits while living abroad you will be asked to provide information about your Irish social insurance record
ro: Puteţi obţine formularele E104 şi U1 (fostul formular E301) în cazul în care călătoriţi pe teritoriul UE/ZEE – citiţi articolul "Cum se poate aplica" de mai jos

source: You can use forms E104 and U1 (formerly E301) when claiming sickness, maternity or unemployment benefits abroad - see 'How to apply' below
ro: E104 şi U1 sunt numite documente portabile şi oferă detalii despre dosarul dumneavoastră de asigurări sociale din Irlanda

source: The U1 is called a portable document and it provides details of your Irish social insurance record
ro: Le puteţi folosi atunci când solicitaţi ajutoarele de boală, maternitate sau şomaj în afara ţării

source: If you don’t bring your E104 or U1 with you, the country you have moved to will contact Irish authorities to get a record of your insurance contributions when you apply to them for unemployment, sickness or maternity benefits
ro: Dacă nu aduceţi E104 sau U1 cu dumneavoastră, ţara în care v-aţi mutat va contacta autorităţile irlandeze şi va obţine dosarul contribuţiilor dumneavoastră la asigurările sociale atunci când aplicaţi pentru beneficii în caz de şomaj, boală sau maternitate

source: A request from another EU member state for your social insurance record will be prioritised by the Department of Social Protection so that you don’t lose out on any benefits due to you when abroad
ro: O cerere din partea unui alt stat membru UE pentru dosarul dumneavoastră de asigurări sociale va fi prioritizat de către Departamentul de Protecţie Socială pentru ca dumneavoastră să nu vă pierdeţi beneficiile atunci când sunteţi în străinătate

source: If you are returning to Ireland from a country in the EU or EEA, you should bring an E104 and U1 form back with you as they will provide details of the insurance contributions you made in that country
ro: Dacă vă reîntoarceţi în Irlanda dintr-o ţară UE/ZEE, trebuie să aduceţi formularul E104 şi U1 cu dumneavoastră întrucât acestea oferă detalii ale contribuţiilor dumneavoastră în ţara respectivă

source: The forms are presented at the relevant social security agency of the country you are living in when you are making a claim
ro: Formularele sunt prezentate la agenţia relevantă de asigurări sociale ale ţării în care locuiţi atunci când veţi face o cerere

source: A request for an E104 or U1 by another EU member state is always prioritised by the Department of Social Protection
ro: Cererea pentru un formular E104 sau U1 de către un alt stat membru UE, este întotdeauna prioritizată de către Departament de Protecţie Socială

source: This is because a person who is unemployed or sick abroad has made a claim for benefit and it must be dealt with as quickly as possible
ro: Aceasta deoarece o persoană care este şomeră sau bolnavă în străinătate a făcut o cerere pentru acordarea de ajutoare şi aceasta trebuie rezolvată cât mai curând posibil

source: If you want to bring your E104 and U1 with you, you can request your Irish social insurance record for E104 and U1 (pdf) before leaving
ro: Dacă doriţi să aduceţi formularele E104 şi U1 cu dumneavoastră, puteţi solicita dosarul de contribuţii sociale din Irlanda - E104 şi U1/E301 (pdf)

source: Processing your application can take some time as the DSP may have to contact your recent employer/s before the E104 and U1 forms can be issued
ro: Procesarea aplicaţiei dumneavoastră poate dura deoarece poate fi necesar ca DPS să contacteze ultimul dumneavoastră angajator/angajatori înainte ca formularele E104 şi U1 să fie emise

source: You should send the completed application form to the International Records Section of the Department of Social Protection - see 'Where to apply' below
ro: Este necesar să trimiteţi aplicaţia completată la Secţiunea Dosare Internaţionale din cadrul Departamentului de Protecţie Socială (DPS) - a se vedea 'Unde depuneţi cererea' mai jos

source: With your application, you must include a copy of your P45, a copy of your P60 and remember to include your address abroad
ro: Împreună cu aplicaţia, trebuie să includeţi şi o copie P45, o copie a P60 şi nu uitaţi să includeţi adresa din străinătate unde veţi locui atunci când părăsiţi Irlanda
